Repository: NightTsarina/ikiwiki
Catalog: po/underlays/directives/ikiwiki/directive/if.*.po
Languages: fr

source: The `if` directive is supplied by the [[!iki plugins/conditional desc=conditional]] plugin.
fr: La directive `if` est fournie par le module d'extension [[!iki plugins/conditional desc=conditional]].

source: With this directive, you can make text be conditionally displayed on a page. For example:
fr: Cette directive permet de faire dépendre l'affichage de texte d'une condition donnée. Par exemple :

source: \[[!if test="enabled(smiley)" then="The smiley plugin is enabled :-)" else="No smiley plugin here.."]]
fr: \[[!if test="enabled(smiley)" then="Le greffon smiley est activé :-)" else="Pas de greffon smiley ici..."]]

source: If the specified `test` succeeds, the `then` text will be displayed, otherwise the `else` text will be displayed. The `else` part is optional.
fr: Si le `test` réussit, le texte du paramètre `then` est affiché. Sinon, le texte du paramètre `else` est affiché. La partie `else` du test est facultative.

source: The `then` and `else` values can include any markup that would be allowed in the wiki page outside the template. Triple-quoting the values even allows quotes to be included.
fr: Les valeurs de `then` et `else` peuvent inclure n'importe quelle balise qui serait autorisée dans les pages du wiki. Tripler les guillemets autour de la valeur permet même d'y inclure des guillemets.

source: The `test` is a [[ikiwiki/PageSpec]]; if it matches any page in the wiki then it succeeds. So you can do things like testing for the existence of a page or pages, testing to see if any pages were created in a given month, and so on.
fr: Le `test` est une spécification [[ikiwiki/PageSpec]]. Si une page correspond à l'expression, le test réussit. Vous pouvez ainsi tester l'existence d'une page ou de plusieurs, tester la date de création, etc.

source: If you want the [[ikiwiki/PageSpec]] to only match against the page that contains the conditional, rather than matching against all pages in the wiki, set the "all" parameter to "no".
fr: Si vous voulez confronter l'expression [[ikiwiki/PageSpec]] uniquement à la page qui contient la condition plutôt qu'à toutes les pages du wiki, il faut donner la valeur "no" au paramètre "all".

source: In an `if` directive, the regular [[ikiwiki/PageSpec]] syntax is expanded with the following additional tests:
fr: Dans une directive `if`, la syntaxe normale d'une spécification [[ikiwiki/PageSpec]] est étendue avec les tests suivants :

source: enabled(plugin)
fr: enabled(greffon)

source: Tests whether the specified plugin is enabled.
fr: Ce test vérifie si le greffon indiqué est activé.

source: sourcepage(glob)
fr: sourcepage(motif)

source: Tests whether the glob matches the name of the page that contains the conditional.
fr: Ce test confronte le motif donné au nom de la page qui contient la condition.

source: destpage(glob)
fr: destpage(motif)

source: Tests whether the glob matches the name of the page that is being built. That might be different than the name of the page that contains the conditional, if it's being inlined into another page.
fr: Ce test confronte le motif donné au nom de la page qui est construite. Ce nom peut être différent du nom de la page qui contient la condition, si la page est reliée à une autre page.

source: Tests whether the page is being included onto another page.
fr: Ce test vérifie si la page est incluse dans une autre page.
